def area(a):
    """
    Возвращает площадь квадрата.

        Параметры:
            a (float) : сторона квадрата

        Возвращаемое значение:
            area (float) : площадь квадрата, вычисленная по формуле a^2

        Пример вывода
            area(5) -> 25
    """
    return a * a


def perimeter(a):
    """
    Возвращает периметр квадрата.

        Параметры:
            a (float) : сторона квадрата

        Возвращаемое значение:
            perimeter (float) : периметр квадрата, вычисленный по формуле 4 * a

        Пример вывода
            perimeter(5) -> 20
    """
    return 4 * a