import math


def area(r):
    """
	Возвращает площадь круга.

        Параметры:
            r (int | float) : радиус круга

        Возвращаемое значение:
            area (float): площадь круга, вычисленная по формуле pi * r^2

        Пример вывода:
            area(3) -> 28.274333882308138

    """
    return math.pi * r * r


def perimeter(r):
    """
    Возвращает длину окружности круга.


        Параметры:
            r (int | float) : радиус круга


        Возвращаемое значение:
            perimeter (float): периметр круга, вычисленный по формуле 2 * pi * r

        Пример вывода
            perimeter(3) -> 18.84955592153876
    """
    return 2 * math.pi * r