def area(a, b):
    """
    Возвращает площадь прямоугольника.


        Параметры:
            a (int | float) : длина одной стороны прямоугольника
            b (int | float) : длина другой стороны прямоугольника

        Возвращаемое значение:
            area (float): площадь прямоугольника, вычисленная по формуле a * b

        Пример вывода
            area(3, 4) -> 12
    """
    return a * b


def perimeter(a, b):
    """
    Возвращает периметр прямоугольника.


        Параметры:
            a (int | float) : длина одной стороны прямоугольника
            b (int | float) : длина другой стороны прямоугольника

        Возвращаемое значение:
            perimeter (float): периметр прямоугольника, вычисленный по формуле (a + b) * 2

        Пример вывода:
            perimeter(3, 4) -> 14
    """
    return (a + b) * 2