def area(a, h):
    """
    Возвращает площадь треугольника.

        Параметры:
            a (float) : основание треугольника
            h (float) : высота, проведённая к основанию

        Возвращаемое значение:
            area (float) : площадь треугольника, вычисленная по формуле a * h / 2

        Пример вывода
            area(6, 4) -> 12.0
    """
    return a * h / 2


def perimeter(a, b, c):
    """
    Возвращает периметр треугольника.

        Параметры:
            a (float) : длина первой стороны треугольника
            b (float) : длина второй стороны треугольника
            c (float) : длина третьей стороны треугольника

        Возвращаемое значение:
            perimeter (float) : периметр треугольника, вычисленный по формуле a + b + c

        Пример вывода
            perimeter(3, 4, 5) -> 12
    """
    return a + b + c